const test = require("node:test");
const assert = require("node:assert");

const { maskPhone } = require("./01.js");

test("Заменить на * все цифры после последней точки", () => {
    const phones = [
        '590.423.4568',
        '650.124.7234',
        '650.507.9879',
        '011.44.1343.529268',
        '011.44.1344.478968',
        '011.44.1644.429267',
        '11.44.1343.52',
        '11.44.1643.52',
    ];
    const phones2 = [
        '434.532.7432',
        '265.633.9323',
        '903.269.3457',
        '624.64.6346.999333',

    ];

    assert.deepStrictEqual(phones.map(maskPhone), [
        '590.423.****',
        '650.124.****',
        '650.507.****',
        '011.44.1343.******',
        '011.44.1344.******',
        '011.44.1644.******',
        '11.44.1343.**',
        '11.44.1643.**'
      ]);
      assert.deepStrictEqual(phones2.map(maskPhone), [
        '434.532.****',
        '265.633.****',
        '903.269.****',
        '624.64.6346.******',

    ]);



});
