const test = require("node:test");
const assert = require("node:assert");

const { getInfo } = require("./03.js");

test(" Количество элементов, которые начинаются на “Цена” и количество элементов, которые заканчиваются на “$”", () => {
    let prices = [ 
        'Цена товара - 1200$', 
        'Стоимость - 500$', 
        'Цена не определена', '9999',
        'Ценовая категория - больше 300$',
        'Цена за услугу 500 EUR',
        '150$',
    ]
    let prices2 = [ 
        'Стоимость товара - 0 рублей ', 
        'Стоимость - 500 рублей ', 
        'Стоимость не определена', '11 рублей',
        'Стоимость категория - больше 333 рублей',
        'Стоимость за услугу 8888 рублей',
            ]
    assert.deepStrictEqual(getInfo(prices), [ 3, 4 ]);   
    assert.deepStrictEqual(getInfo(prices2), [ 0, 0 ]);   


});
